{
  "title": "BBC News - Breaking news, video and the latest top stories from the U.S. and around the world",
  "content": "News\nNews\nLIVE\nHurricane Melissa barrels towards Cuba as Jamaica warned of more 'catastrophic' flooding\nThe category three hurricane is the strongest storm to ever hit Jamaica in modern history.\nStrong winds and flying debris as Hurricane Melissa makes landfall\nStorm surges of 13 feet (3.9m) above ground level and destructive waves are expected as the storm hits Jamaica.\n7 hrs ago\nLatin America\nUS kills 14 in strikes on four alleged drug boats in Pacific\nMexico's navy is searching for the sole survivor of the latest attack on boats the US says were carrying drugs in both the Pacific and Caribbean.\n7 hrs ago\nWorld\nBrigitte Macron's life 'deteriorated' after alleged cyber-bullying, daughter says\nTiphaine Auzière was testifying in the trial of ten people accused of cyber-bullying her mother, the French first lady.\n8 hrs ago\nEurope\nWindows blown in, trees uprooted and croc warnings - Hurricane Melissa batters Jamaica\nThe eye of the storm has passed over Jamaica but it is still battering the island - the eye is now heading towards Cuba.\n24 mins ago\nLatin America\nStrong winds and flying debris as Hurricane Melissa makes landfall\nStorm surges of 13 feet (3.9m) above ground level and destructive waves are expected as the storm hits Jamaica.\n7 hrs ago\nLatin America\nIsrael strikes Gaza after accusing Hamas of ceasefire violations\nHamas denies it was behind an attack on Israeli forces inside an area of Gaza under their control and condemns the strikes.\n2 hrs ago\nMiddle East\n'No Trump! No China!': Caught in the middle, South Korea hosts rival superpowers\nSouth Korea's President Lee is in for a diplomatic dance as he hosts the leaders of US and China.\n4 hrs ago\nWorld\nLIVE\nTrump arrives in South Korea following North's missile test\nThe US leader is on the final leg of his high-stakes Asia tour that includes a meeting with Chinese leader Xi Jinping.\nUS kills 14 in strikes on four alleged drug boats in Pacific\nMexico's navy is searching for the sole survivor of the latest attack on boats the US says were carrying drugs in both the Pacific and Caribbean.\n7 hrs ago\nWorld\nViktor Orban's dilemma - Russian oil or Trump's favour\nHalf of US states sue Trump administration over halting food stamps\nBBC 'deeply concerned' about journalist unable to leave Vietnam\nPrince Andrew hosted Epstein, Maxwell and Weinstein at Royal Lodge\nTexas attorney general sues Tylenol makers over autism claims\nMore to explore\n'We are all terrified', say locals in path of Hurricane Melissa\n\"I am trying to use my own manpower to stop the wind blowing in the door,\" a frightened mother tells the BBC.\n2 hrs ago\nLatin America\nHow a Hollywood tour guide discovered an unknown celebrity grave\nThe Bride of Frankenstein actress Elsa Lanchester will be celebrated on October 28, her 123rd birthday.\n1 day ago\nUS & Canada\nThe 92-year-old president who never loses\nCameroon's Paul Biya has extended his 43-year rule by winning a heavily disputed election.\n1 day ago\nAfrica\nPrunella Scales: From Fawlty Towers to Great Canal Journeys\nThe versatile actress, who has died aged 93, will be best remembered for her portrayal of Sybil Fawlty.\n16 hrs ago\nCulture\nRare earths, Nobel nomination and cheers: Trump ends Japan leg of Asia tour\nThe red carpet was rolled out for Trump by Japan's Sanae Takaichi, who has only been prime minister since last week.\n17 hrs ago\nAsia\nHow a Hollywood tour guide discovered an unknown celebrity grave\nThe Bride of Frankenstein actress Elsa Lanchester will be celebrated on October 28, her 123rd birthday.\n1 day ago\nUS & Canada\n'My wife died in childbirth but wasn't told she'd been given labour drug overdose'\nJacqui Hunter died less than 24 hours after being told that her daughter had died in the womb.\n21 hrs ago\nScotland\nChina controls the rare earths the world buys - can Trump's new deals change that?\nThe agreements are a clear bid to reduce dependence on China, ahead of a key meeting with Xi Jinping.\n20 hrs ago\nAsia\nThe 92-year-old president who never loses\nCameroon's Paul Biya has extended his 43-year rule by winning a heavily disputed election.\n1 day ago\nAfrica\nMost watched\n1\nStrong winds and flying debris as Hurricane Melissa makes landfall\n2\nWatch: Storm chasers fly inside the eye of Hurricane Melissa\n3\nWatch: Satellite video shows Hurricane Melissa intensifying near Jamaica\n4\nWatch Prunella Scales's memorable moments in Fawlty Towers\n5\nTV star says rowing challenge led to relapse after sobriety\nAlso in news\nTexas attorney general sues Tylenol makers over autism claims\nHe accuses them of hiding alleged dangers from the drug, following the Trump administration's unproven claim it is linked to autism.\n12 hrs ago\nUS & Canada\nMost countries fail to submit new climate pledges ahead of summit\nThe UN's review of national climate plans shows the world is well off track to limit warming\n16 hrs ago\nClimate\nIsrael says coffin from Hamas did not contain another hostage's body\nIsrael accuses Hamas of a \"clear violation\" of the ceasefire deal after tests showed the remains belonged to a person whose body was previously returned.\n10 hrs ago\nWorld\nConfederate statue torn down during anti-racism protests reinstalled in Washington\nGeneral Albert Pike's statue, toppled during George Floyd protests in 2020, is restored under orders from President Donald Trump.\n14 hrs ago\nUS & Canada\nAustralia deports first foreign detainees to Nauru in controversial deal\nThe first transfer of the so-called NZYQ cohort to the tiny Pacific island marks the start of a A$2.5bn agreement between Australia and Nauru.\n14 hrs ago\nAustralia\nMost countries fail to submit new climate pledges ahead of summit\nThe UN's review of national climate plans shows the world is well off track to limit warming\n16 hrs ago\nClimate\nTrump appeals against conviction in hush-money case\nHis lawyers invoked presidential immunity and claimed the prosecution was politically motivated.\n8 hrs ago\nUS & Canada\nChatGPT shares data on how many users exhibit psychosis or suicidal thoughts\nThe figure could mean potentially hundreds of thousands of users show signs of mental health distress weekly.\n1 day ago\nIsrael says coffin from Hamas did not contain another hostage's body\nIsrael accuses Hamas of a \"clear violation\" of the ceasefire deal after tests showed the remains belonged to a person whose body was previously returned.\n10 hrs ago\nWorld\nMost read\n1\nElderly woman left behind by cruise ship on Great Barrier Reef island found dead\n2\nWindows blown in, trees uprooted and croc warnings - Hurricane Melissa batters Jamaica\n3\n'No Trump! No China!': Caught in the middle, South Korea hosts rival superpowers\n4\nBrigitte Macron's life 'deteriorated' after alleged cyber-bullying, daughter says\n5\nUS kills 14 in strikes on four alleged drug boats in Pacific\n6\nAt least 64 killed in Rio's largest police raid on gangs\n7\nTexas attorney general sues Tylenol makers over autism claims\n8\nAustralian girls being 'hunted' by online crime gangs to commit violent acts\n9\nIsrael strikes Gaza after accusing Hamas of ceasefire violations\n10\nHalf of US states sue Trump administration over halting food stamps\nSport\nLIVE\nEngland need another Brook rescue act against New Zealand\nFollow live text updates as England face New Zealand in Hamilton in the second of three ODIs.\nBeever-Jones 'asking questions' - should she start for England?\nSarina Wiegman has had some tough decisions to make over England's strikers - and Aggie Beever-Jones has made it even harder after the 3-0 friendly win against Australia.\n4 hrs ago\nEngland Women\nNorrie stuns Alcaraz for 'biggest win of career'\nBritish's Cameron Norrie stuns world number one Carlos Alcaraz with a gritty comeback in the second round at the Paris Masters.\n4 hrs ago\nTennis\n'Awful moment' as Agyemang is carried off injured\nEngland striker Michelle Agyemang is carried off on a stretcher after an off-the-ball injury in the Lionesses' 3-0 win against Australia.\n4 hrs ago\nEngland Women\nSuper League in danger of 'train crash' - NRL chief V'landys\nSuper League is heading for a \"train crash\" if it does not find ways to grow its revenue, the head of Australia's NRL has warned.\n9 hrs ago\nRugby League\nBeever-Jones 'asking questions' - should she start for England?\nSarina Wiegman has had some tough decisions to make over England's strikers - and Aggie Beever-Jones has made it even harder after the 3-0 friendly win against Australia.\n4 hrs ago\nEngland Women\nRodgers v Desmond: Analysing the Celtic fallout\nBBC Sport Scotland's chief sportswriter Tom English breaks down the public statements of Dermot Desmond and Brendan Rodgers to try to get to the bottom of the claims and counter-claims at Celtic.\n10 hrs ago\nCeltic\nNorrie stuns Alcaraz for 'biggest win of career'\nBritish's Cameron Norrie stuns world number one Carlos Alcaraz with a gritty comeback in the second round at the Paris Masters.\n4 hrs ago\nTennis",
  "domain": "www.bbc.com",
  "url": "https://www.bbc.com/news"
}