{
  "title": "Objectively, how much does DoorDash make from SNAP ?",
  "content": "Objectively, how much does DoorDash make from SNAP ?\nObject Wire\n>>\nDetective Reporting Austin\nHow much does DoorDash make from SNAP ?\nConan  Doyle  • October 28, 2025\nButton\nButton\nButton\nButton\nIn a world where grocery runs can feel like a quest worthy of a delivery app's dramatic loading screen, the question of whether DoorDash accepts EBT (Electronic Benefits Transfer) cards tied to SNAP (Supplemental Nutrition Assistance Program) is accepted on DoorDash and Uber Eats?\nThe short answer:\nYes, DoorDash does accept EBT\nfor eligible grocery purchases, but with strings attached tighter than a dasher's backpack strap. This acceptance rolled out in 2023, expanding access for millions. Below, we break it down with data from official sources, user trends, and program economics—no opinions, just the numbers and how they stack up.\nUnderstanding EBT and SNAP: The Foundation\nEBT cards deliver SNAP benefits, a federal program aiding low-income households with food purchases.\nIn fiscal year 2023, SNAP dished out $112.8 billion in benefits\n, reaching an average of 41.2 million participants monthly—about\n12.6% of the U.S. population\n.\nSo what happens next week when the goverment doesent have enough money to pay snap, as it is on shut down as of early October 25'\nWell for one Doordash will lose lots of revenue.\nThe same is the case fpr big soda. See article how\nSNAP pays Big Soda, millions per year.\nDoorDash began accepting SNAP/EBT payments in select markets in 2023, with nationwide expansion by early 2024.\nAdding EBT to Your DoorDash Account: Step-by-Step Stats\nGetting started is straightforward, per guidance from program navigators. Head to Account > Payment > Program Cards (SNAP/EBT) in the app to link your card—a process completed by those 1.8 million users.\nOnce added, 95% of surveyed SNAP users found the setup \"easy and quick.\"\nUsage data shows stickiness: Nearly half of active SNAP consumers on DoorDash placed more than one order in the past month.\nSo how much money does DoorDash and apps like Uber make from Supplemental Nutrition Assistance Program?\nExact revenue from SNAP isn't publicly sliced in DoorDash's filings—their 2024 total hit $10.72 billion, up 24.2% year-over-year. But piecing together usage data yields estimates. With 1.8 million EBT users and one-third averaging $100+ monthly SNAP spend on eligible items, total annual SNAP grocery volume on the platform likely exceeds $600 million (assuming conservative $50 average monthly spend across actives).\nDoorDash earns via merchant commissions (typically 15-20% on orders) and user fees. Applying a 15% clip to that volume suggests roughly $90 million in direct SNAP-tied revenue for 2024— a sliver of the pie, but growing amid 2.6 billion total orders. This doesn't tally broader economic ripples, like the $106 billion in U.S. activity DoorDash fueled overall. Stay infomed subscribe to\nobjectwire.org\nLogin with Discord to comment\nSubmit Comment\n< Older Post\nSTAY UP TO DATE\nGET Objective LATEST\nUsefull links\nContact info\n(575) 495-0323\nJack@objectwire.org\n2921 E 17th St Building 3, APT 3205, Austin, TX 78702\nFollow us\n© 2025\nAll Rights Reserved | Object-Wire\nShare by:",
  "domain": "www.objectwire.org",
  "url": "https://www.objectwire.org/does-doordash-take-snap"
}